Add stack diagrams to README
